#include "insert.h" // підключення заголовкового файлу
#include <iostream> // підключення бібліотеки для роботи з введенням/виведенням 
#include <string> // підключення бібліотеки для роботи з типом string
using namespace std;

//string& insert(size_t pos, const string& str);

void task_1() { // функція виконання завдання 1
    string str = "Життя питання"; // початковий рядок
    string str2 = "це не лише "; // рядок, який буде вставлено в середину
    string str3 = "а й відповідь"; // рядок який буде вставлено в кінець

    str.insert(6, " "); // вставка пробілу після слова "Життя"
    str.insert(7, str2); // вставка рядка "це не лише " після попереднього пробілу

    str.insert(6, "—"); // вставка тире після першого пробілу 

    auto it = str.begin() + 26; // перестановка ітератора на місце перед "а"
    it = str.insert(it, ','); // вставка "," на цьому місці

    string part = " " + str3; // підготовка рядка з пробілом і фразою "а й відповідь"
    str.insert(it + 1, part.begin(), part.end()); // вставка підготовленого рядка після коми

    str.insert(str.end(), 3, '.'); // додавання трьох крапкок у кінці

    cout << str << '\n'; // виведення фінального результату
}
